apache/nuttx/arch/arm/src/stm32/hardware/stm32_adc_v1.h
#if STM32_NADC > 1
#  define STM32_ADC2_SR              (STM32_ADC2_BASE + STM32_ADC_SR_OFFSET)
#  define STM32_ADC2_CR1             (STM32_ADC2_BASE + STM32_ADC_CR1_OFFSET)
#  define STM32_ADC2_CR2             (STM32_ADC2_BASE + STM32_ADC_CR2_OFFSET)
#  define STM32_ADC2_SMPR1           (STM32_ADC2_BASE + STM32_ADC_SMPR1_OFFSET)
#  define STM32_ADC2_SMPR2           (STM32_ADC2_BASE + STM32_ADC_SMPR2_OFFSET)
#  define STM32_ADC2_JOFR1           (STM32_ADC2_BASE + STM32_ADC_JOFR1_OFFSET)
#  define STM32_ADC2_JOFR2           (STM32_ADC2_BASE + STM32_ADC_JOFR2_OFFSET)
#  define STM32_ADC2_JOFR3           (STM32_ADC2_BASE + STM32_ADC_JOFR3_OFFSET)
#  define STM32_ADC2_JOFR4           (STM32_ADC2_BASE + STM32_ADC_JOFR4_OFFSET)
#  define STM32_ADC2_HTR             (STM32_ADC2_BASE + STM32_ADC_HTR_OFFSET)
#  define STM32_ADC2_LTR             (STM32_ADC2_BASE + STM32_ADC_LTR_OFFSET)
#  define STM32_ADC2_SQR1            (STM32_ADC2_BASE + STM32_ADC_SQR1_OFFSET)
#  define STM32_ADC2_SQR2            (STM32_ADC2_BASE + STM32_ADC_SQR2_OFFSET)
#  define STM32_ADC2_SQR3            (STM32_ADC2_BASE + STM32_ADC_SQR3_OFFSET)
#  define STM32_ADC2_JSQR            (STM32_ADC2_BASE + STM32_ADC_JSQR_OFFSET)
#  define STM32_ADC2_JDR1            (STM32_ADC2_BASE + STM32_ADC_JDR1_OFFSET)
#  define STM32_ADC2_JDR2            (STM32_ADC2_BASE + STM32_ADC_JDR2_OFFSET)
#  define STM32_ADC2_JDR3            (STM32_ADC2_BASE + STM32_ADC_JDR3_OFFSET)
#  define STM32_ADC2_JDR4            (STM32_ADC2_BASE + STM32_ADC_JDR4_OFFSET)
#  define STM32_ADC2_DR              (STM32_ADC2_BASE + STM32_ADC_DR_OFFSET)
#endif

#if STM32_NADC > 2
#  define STM32_ADC3_SR              (STM32_ADC3_BASE + STM32_ADC_SR_OFFSET)
#  define STM32_ADC3_CR1             (STM32_ADC3_BASE + STM32_ADC_CR1_OFFSET)
#  define STM32_ADC3_CR2             (STM32_ADC3_BASE + STM32_ADC_CR2_OFFSET)
#  define STM32_ADC3_SMPR1           (STM32_ADC3_BASE + STM32_ADC_SMPR1_OFFSET)
#  define STM32_ADC3_SMPR2           (STM32_ADC3_BASE + STM32_ADC_SMPR2_OFFSET)
#  define STM32_ADC3_JOFR1           (STM32_ADC3_BASE + STM32_ADC_JOFR1_OFFSET)
#  define STM32_ADC3_JOFR2           (STM32_ADC3_BASE + STM32_ADC_JOFR2_OFFSET)
#  define STM32_ADC3_JOFR3           (STM32_ADC3_BASE + STM32_ADC_JOFR3_OFFSET)
#  define STM32_ADC3_JOFR4           (STM32_ADC3_BASE + STM32_ADC_JOFR4_OFFSET)
#  define STM32_ADC3_HTR             (STM32_ADC3_BASE + STM32_ADC_HTR_OFFSET)
#  define STM32_ADC3_LTR             (STM32_ADC3_BASE + STM32_ADC_LTR_OFFSET)
#  define STM32_ADC3_SQR1            (STM32_ADC3_BASE + STM32_ADC_SQR1_OFFSET)
#  define STM32_ADC3_SQR2            (STM32_ADC3_BASE + STM32_ADC_SQR2_OFFSET)
#  define STM32_ADC3_SQR3            (STM32_ADC3_BASE + STM32_ADC_SQR3_OFFSET)
#  define STM32_ADC3_JSQR            (STM32_ADC3_BASE + STM32_ADC_JSQR_OFFSET)
#  define STM32_ADC3_JDR1            (STM32_ADC3_BASE + STM32_ADC_JDR1_OFFSET)
#  define STM32_ADC3_JDR2            (STM32_ADC3_BASE + STM32_ADC_JDR2_OFFSET)
#  define STM32_ADC3_JDR3            (STM32_ADC3_BASE + STM32_ADC_JDR3_OFFSET)
#  define STM32_ADC3_JDR4            (STM32_ADC3_BASE + STM32_ADC_JDR4_OFFSET)
#  define STM32_ADC3_DR              (STM32_ADC3_BASE + STM32_ADC_DR_OFFSET)
#endif

#ifndef HAVE_BASIC_ADC
#  define STM32_ADC_CSR              (STM32_ADCCMN_BASE + STM32_ADC_CSR_OFFSET)
#  define STM32_ADC_CCR              (STM32_ADCCMN_BASE + STM32_ADC_CCR_OFFSET)
#  define STM32_ADC_CDR              (STM32_ADCCMN_BASE + STM32_ADC_CDR_OFFSET)
#endif

/* Register Bitfield Definitions ********************************************/

/* ADC status register */

#define ADC_SR_AWD                   (1 << 0)  /* Bit 0 : Analog watchdog flag */
#define ADC_SR_EOC                   (1 << 1)  /* Bit 1 : End of conversion */
#define ADC_SR_JEOC                  (1 << 2)  /* Bit 2 : Injected channel end of conversion */
#define ADC_SR_JSTRT                 (1 << 3)  /* Bit 3 : Injected channel Start flag */
#define ADC_SR_STRT                  (1 << 4)  /* Bit 4 : Regular channel Start flag */
#ifndef HAVE_BASIC_ADC
#  define ADC_SR_OVR                 (1 << 5)  /* Bit 5 : Overrun */
#endif

/* ADC control register 1 */

#define ADC_CR1_AWDCH_SHIFT          (0)       /* Bits 4-0: Analog watchdog channel select bits */
#define ADC_CR1_AWDCH_MASK           (0x1f << ADC_CR1_AWDCH_SHIFT)

#define ADC_CR1_EOCIE                (1 << 5)  /* Bit 5: Interrupt enable for EOC */
#define ADC_CR1_AWDIE                (1 << 6)  /* Bit 6: Analog Watchdog interrupt enable */
#define ADC_CR1_JEOCIE               (1 << 7)  /* Bit 7: Interrupt enable for injected channels */
#define ADC_CR1_SCAN                 (1 << 8)  /* Bit 8: Scan mode */
#define ADC_CR1_AWDSGL               (1 << 9)  /* Bit 9: Enable the watchdog on a single channel in scan mode */
#define ADC_CR1_JAUTO                (1 << 10) /* Bit 10: Automatic Injected Group conversion */
#define ADC_CR1_DISCEN               (1 << 11) /* Bit 11: Discontinuous mode on regular channels */
#define ADC_CR1_JDISCEN              (1 << 12) /* Bit 12: Discontinuous mode on injected channels */

#define ADC_CR1_DISCNUM_SHIFT        (13)      /* Bits 15-13: Discontinuous mode channel count */
#define ADC_CR1_DISCNUM_MASK         (0x07 << ADC_CR1_DISCNUM_SHIFT)

#ifdef HAVE_BASIC_ADC
#  define ADC_CR1_DUALMOD_SHIFT      (16)      /* Bits 19-16: Dual mode selection */
#  define ADC_CR1_DUALMOD_MASK       (0x0f << ADC_CR1_DUALMOD_SHIFT)
#    define ADC_CR1_IND              (0 << ADC_CR1_DUALMOD_SHIFT) /* 0000: Independent mode */
#    define ADC_CR1_RSIS             (1 << ADC_CR1_DUALMOD_SHIFT) /* 0001: Combined regular simultaneous + injected simultaneous mode */
#    define ADC_CR1_RSAT             (2 << ADC_CR1_DUALMOD_SHIFT) /* 0010: Combined regular simultaneous + alternate trigger mode */
#    define ADC_CR1_ISFI             (3 << ADC_CR1_DUALMOD_SHIFT) /* 0011: Combined injected simultaneous + fast interleaved mode */
#    define ADC_CR1_ISFL             (4 << ADC_CR1_DUALMOD_SHIFT) /* 0100: Combined injected simultaneous + slow Interleaved mode */
#    define ADC_CR1_IS               (5 << ADC_CR1_DUALMOD_SHIFT) /* 0101: Injected simultaneous mode only */
#    define ADC_CR1_RS               (6 << ADC_CR1_DUALMOD_SHIFT) /* 0110: Regular simultaneous mode only */
#    define ADC_CR1_FI               (7 << ADC_CR1_DUALMOD_SHIFT) /* 0111: Fast interleaved mode only */
#    define ADC_CR1_SI               (8 << ADC_CR1_DUALMOD_SHIFT) /* 1000: Slow interleaved mode only */
#    define ADC_CR1_AT               (9 << ADC_CR1_DUALMOD_SHIFT) /* 1001: Alternate trigger mode only */
#endif

#define ADC_CR1_JAWDEN               (1 << 22) /* Bit 22: Analog watchdog enable on injected channels */
#define ADC_CR1_AWDEN                (1 << 23) /* Bit 23: Analog watchdog enable on regular channels */

#ifndef HAVE_BASIC_ADC
#  define ADC_CR1_RES_SHIFT          (24)      /* Bits 24-25: Resolution */
#  define ADC_CR1_RES_MASK           (3 << ADC_CR1_RES_SHIFT)
#    define ADC_CR1_RES_12BIT        (0 << ADC_CR1_RES_SHIFT) /* 15 ADCCLK cycles */
#    define ADC_CR1_RES_10BIT        (1 << ADC_CR1_RES_SHIFT) /* 13 ADCCLK cycles */
#    define ADC_CR1_RES_8BIT         (2 << ADC_CR1_RES_SHIFT) /* 11 ADCCLK cycles */
#    define ADC_CR1_RES_6BIT         (3 << ADC_CR1_RES_SHIFT) /* 9 ADCCLK cycles */

#  define ADC_CR1_OVRIE              (1 << 26) /* Bit 26: Overrun interrupt enable */
#  define ADC_CR1_RESERVED           (0xfb3f0000)
#endif

/* ADC control register 2 */

#define ADC_CR2_ADON                 (1 << 0)  /* Bit 0: A/D Converter ON / OFF */
#define ADC_CR2_CONT                 (1 << 1)  /* Bit 1: Continuous Conversion */
#ifdef HAVE_BASIC_ADC
#  define ADC_CR2_CAL                (1 << 2)  /* Bit 2: A/D Calibration */
#  define ADC_CR2_RSTCAL             (1 << 3)  /* Bit 3: Reset Calibration */
#endif
#define ADC_CR2_DMA                  (1 << 8)  /* Bit 8: Direct Memory access mode */
#ifndef HAVE_BASIC_ADC
#  define ADC_CR2_DDS                (1 << 9)  /* Bit 9: DMA disable selection (for single ADC mode) */
#  define ADC_CR2_EOCS               (1 << 10) /* Bit 10: End of conversion selection */
#endif

#define ADC_CR2_ALIGN                (1 << 11) /* Bit 11: Data Alignment */

#ifndef HAVE_BASIC_ADC
                                               /* Bits 12-15: Reserved */
#  define ADC_CR2_JEXTSEL_SHIFT      (16)      /* Bits 16-19: External event select for injected group */
#  define ADC_CR2_JEXTSEL_MASK       (0x0F << ADC_CR2_JEXTSEL_SHIFT)
#    define ADC_CR2_JEXTSEL_T1CC4    (0x00 << ADC_CR2_JEXTSEL_SHIFT) /* 0000: Timer 1 CC4 event */
#    define ADC_CR2_JEXTSEL_T1TRGO   (0x01 << ADC_CR2_JEXTSEL_SHIFT) /* 0001: Timer 1 TRGO event */
#    define ADC_CR2_JEXTSEL_T2CC1    (0x02 << ADC_CR2_JEXTSEL_SHIFT) /* 0010: Timer 2 CC1 event */
#    define ADC_CR2_JEXTSEL_T2TRGO   (0x03 << ADC_CR2_JEXTSEL_SHIFT) /* 0011: Timer 2 TRGO event */
#    define ADC_CR2_JEXTSEL_T3CC2    (0x04 << ADC_CR2_JEXTSEL_SHIFT) /* 0100: Timer 3 CC2 event */
#    define ADC_CR2_JEXTSEL_T3CC4    (0x05 << ADC_CR2_JEXTSEL_SHIFT) /* 0101: Timer 3 CC4 event */
#    define ADC_CR2_JEXTSEL_T4CC1    (0x06 << ADC_CR2_JEXTSEL_SHIFT) /* 0110: Timer 4 CC1 event */
#    define ADC_CR2_JEXTSEL_T4CC2    (0x07 << ADC_CR2_JEXTSEL_SHIFT) /* 0111: Timer 4 CC2 event */
#    define ADC_CR2_JEXTSEL_T4CC3    (0x08 << ADC_CR2_JEXTSEL_SHIFT) /* 1000: Timer 4 CC3 event */
#    define ADC_CR2_JEXTSEL_T4TRGO   (0x09 << ADC_CR2_JEXTSEL_SHIFT) /* 1001: Timer 4 TRGO event */
#    define ADC_CR2_JEXTSEL_T5CC4    (0x0A << ADC_CR2_JEXTSEL_SHIFT) /* 1010: Timer 5 CC4 event */
#    define ADC_CR2_JEXTSEL_T5TRGO   (0x0B << ADC_CR2_JEXTSEL_SHIFT) /* 1011: Timer 5 TRGO event */
#    define ADC_CR2_JEXTSEL_T8CC2    (0x0C << ADC_CR2_JEXTSEL_SHIFT) /* 1100: Timer 8 CC2 event */
#    define ADC_CR2_JEXTSEL_T8CC3    (0x0D << ADC_CR2_JEXTSEL_SHIFT) /* 1101: Timer 8 CC3 event */
#    define ADC_CR2_JEXTSEL_T8CC4    (0x0E << ADC_CR2_JEXTSEL_SHIFT) /* 1110: Timer 8 CC4 event */
#    define ADC_CR2_JEXTSEL_EXTI15   (0x0F << ADC_CR2_JEXTSEL_SHIFT) /* 1111: EXTI line 15 */

