apache/nuttx/arch/arm/src/stm32/hardware/stm32_adc_v1.h
#  define ADC_CR2_JEXTEN_SHIFT       (20)      /* Bits 20-21: External trigger enable for injected channels */
#  define ADC_CR2_JEXTEN_MASK        (3 << ADC_CR2_JEXTEN_SHIFT)
#    define ADC_CR2_JEXTEN_NONE      (0 << ADC_CR2_JEXTEN_SHIFT) /* 00: Trigger detection disabled */
#    define ADC_CR2_JEXTEN_RISING    (1 << ADC_CR2_JEXTEN_SHIFT) /* 01: Trigger detection on the rising edge */
#    define ADC_CR2_JEXTEN_FALLING   (2 << ADC_CR2_JEXTEN_SHIFT) /* 10: Trigger detection on the falling edge */
#    define ADC_CR2_JEXTEN_BOTH      (3 << ADC_CR2_JEXTEN_SHIFT) /* 11: Trigger detection on both the rising and falling edges */

#  define ADC_CR2_JSWSTART           (1 << 22) /* Bit 22: Start Conversion of injected channels */
                                               /* Bit 23: Reserved, must be kept at reset value. */
#  define ADC_CR2_EXTSEL_SHIFT       (24)      /* Bits 24-27: External Event Select for regular group */
#  define ADC_CR2_EXTSEL_MASK        (0x0F << ADC_CR2_EXTSEL_SHIFT)
#    define ADC_CR2_EXTSEL_T1CC1     (0x0 << ADC_CR2_EXTSEL_SHIFT)  /* 0000: Timer 1 CC1 event */
#    define ADC_CR2_EXTSEL_T1CC2     (0x01 << ADC_CR2_EXTSEL_SHIFT) /* 0001: Timer 1 CC2 event */
#    define ADC_CR2_EXTSEL_T1CC3     (0x02 << ADC_CR2_EXTSEL_SHIFT) /* 0010: Timer 1 CC3 event */
#    define ADC_CR2_EXTSEL_T2CC2     (0x03 << ADC_CR2_EXTSEL_SHIFT) /* 0011: Timer 2 CC2 event */
#    define ADC_CR2_EXTSEL_T2CC3     (0x04 << ADC_CR2_EXTSEL_SHIFT) /* 0100: Timer 2 CC3 event */
#    define ADC_CR2_EXTSEL_T2CC4     (0x05 << ADC_CR2_EXTSEL_SHIFT) /* 0101: Timer 2 CC4 event */
#    define ADC_CR2_EXTSEL_T2TRGO    (0x06 << ADC_CR2_EXTSEL_SHIFT) /* 0110: Timer 2 TRGO event */
#    define ADC_CR2_EXTSEL_T3CC1     (0x07 << ADC_CR2_EXTSEL_SHIFT) /* 0111: Timer 3 CC1 event */
#    define ADC_CR2_EXTSEL_T3TRGO    (0x08 << ADC_CR2_EXTSEL_SHIFT) /* 1000: Timer 3 TRGO event */
#    define ADC_CR2_EXTSEL_T4CC4     (0x09 << ADC_CR2_EXTSEL_SHIFT) /* 1001: Timer 4 CC4 event */
#    define ADC_CR2_EXTSEL_T5CC1     (0x0A << ADC_CR2_EXTSEL_SHIFT) /* 1010: Timer 5 CC1 event */
#    define ADC_CR2_EXTSEL_T5CC2     (0x0B << ADC_CR2_EXTSEL_SHIFT) /* 1011: Timer 5 CC2 event */
#    define ADC_CR2_EXTSEL_T5CC3     (0x0C << ADC_CR2_EXTSEL_SHIFT) /* 1100: Timer 5 CC3 event */
#    define ADC_CR2_EXTSEL_T8CC1     (0x0D << ADC_CR2_EXTSEL_SHIFT) /* 1101: Timer 8 CC1 event */
#    define ADC_CR2_EXTSEL_T8TRGO    (0x0E << ADC_CR2_EXTSEL_SHIFT) /* 1110: Timer 8 TRGO event */
#    define ADC_CR2_EXTSEL_EXTI11    (0x0F << ADC_CR2_EXTSEL_SHIFT) /* 1111: EXTI line 11 */

#  define ADC_CR2_EXTEN_SHIFT        (28)      /* Bits 28-29: External trigger enable for regular channels */
#  define ADC_CR2_EXTEN_MASK         (3 << ADC_CR2_EXTEN_SHIFT)
#    define ADC_CR2_EXTEN_NONE       (0 << ADC_CR2_EXTEN_SHIFT) /* 00: Trigger detection disabled */
#    define ADC_CR2_EXTEN_RISING     (1 << ADC_CR2_EXTEN_SHIFT) /* 01: Trigger detection on the rising edge */
#    define ADC_CR2_EXTEN_FALLING    (2 << ADC_CR2_EXTEN_SHIFT) /* 10: Trigger detection on the falling edge */
#    define ADC_CR2_EXTEN_BOTH       (3 << ADC_CR2_EXTEN_SHIFT) /* 11: Trigger detection on both the rising and falling edges */

#  define ADC_CR2_SWSTART            (1 << 30) /* Bit 30: Start Conversion of regular channels */
#  define ADC_CR2_RESERVED           (0x8080f0fc)
#else                                     /* HAVE_BASIC_ADC */
#  define ADC_CR2_JEXTSEL_SHIFT      (12)      /* Bits 12-14: External event select for injected group */
#  define ADC_CR2_JEXTSEL_MASK       (7 << ADC_CR2_JEXTSEL_SHIFT)
#  if defined(CONFIG_STM32_STM32F37XX)
#    define ADC_CR2_JEXTSEL_T19CC1   (0 << ADC_CR2_JEXTSEL_SHIFT)
#    define ADC_CR2_JEXTSEL_T19CC2   (1 << ADC_CR2_JEXTSEL_SHIFT)
#  else
#    define ADC_CR2_JEXTSEL_T1TRGO   (0 << ADC_CR2_JEXTSEL_SHIFT) /* 000: Timer 1 TRGO event */
#    define ADC_CR2_JEXTSEL_T1CC4    (1 << ADC_CR2_JEXTSEL_SHIFT) /* 001: Timer 1 CC4 event */
#  endif
#    define ADC_CR2_JEXTSEL_T2TRGO   (2 << ADC_CR2_JEXTSEL_SHIFT) /* 010: Timer 2 TRGO event */
#    define ADC_CR2_JEXTSEL_T2CC1    (3 << ADC_CR2_JEXTSEL_SHIFT) /* 011: Timer 2 CC1 event */
#    define ADC_CR2_JEXTSEL_T3CC4    (4 << ADC_CR2_JEXTSEL_SHIFT) /* 100: Timer 3 CC4 event */
#    define ADC_CR2_JEXTSEL_T4TRGO   (5 << ADC_CR2_JEXTSEL_SHIFT) /* 101: Timer 4 TRGO event */
#    define ADC_CR2_JEXTSEL_EXTI15   (6 << ADC_CR2_JEXTSEL_SHIFT) /* 110: EXTI line 15 */
#    define ADC_CR2_JEXTSEL_JSWSTART (7 << ADC_CR2_JEXTSEL_SHIFT) /* 111: JSWSTART */

#  define ADC_CR2_JEXTTRIG           (1 << 15) /* Bit 15: External Trigger Conversion mode for injected channels */
#  define ADC_CR2_EXTSEL_SHIFT       (17)      /* Bits 19-17: External Event Select for regular group */
#  define ADC_CR2_EXTSEL_MASK        (7 << ADC_CR2_EXTSEL_SHIFT)
#  if defined(CONFIG_STM32_STM32F37XX)
#    define ADC_CR2_EXTSEL_T19TRGO   (0 << ADC_CR2_EXTSEL_SHIFT)
#    define ADC_CR2_EXTSEL_T19CC3    (1 << ADC_CR2_EXTSEL_SHIFT)
#    define ADC_CR2_EXTSEL_T19CC4    (2 << ADC_CR2_EXTSEL_SHIFT)
#  else
#    define ADC_CR2_EXTSEL_T1CC1     (0 << ADC_CR2_EXTSEL_SHIFT) /* 000: Timer 1 CC1 event */
#    define ADC_CR2_EXTSEL_T1CC2     (1 << ADC_CR2_EXTSEL_SHIFT) /* 001: Timer 1 CC2 event */
#    define ADC_CR2_EXTSEL_T1CC3     (2 << ADC_CR2_EXTSEL_SHIFT) /* 010: Timer 1 CC3 event */
#  endif
#    define ADC_CR2_EXTSEL_T2CC2     (3 << ADC_CR2_EXTSEL_SHIFT) /* 011: Timer 2 CC2 event */
#    define ADC_CR2_EXTSEL_T3TRGO    (4 << ADC_CR2_EXTSEL_SHIFT) /* 100: Timer 3 TRGO event */
#    define ADC_CR2_EXTSEL_T4CC4     (5 << ADC_CR2_EXTSEL_SHIFT) /* 101: Timer 4 CC4 event */
#    define ADC_CR2_EXTSEL_EXTI11    (6 << ADC_CR2_EXTSEL_SHIFT) /* 110: EXTI line 11 */
#    define ADC_CR2_EXTSEL_SWSTART   (7 << ADC_CR2_EXTSEL_SHIFT) /* 111: SWSTART */

#  define ADC_CR2_EXTTRIG            (1 << 20) /* Bit 20: External Trigger Conversion mode for regular channels */
#  define ADC_CR2_JSWSTART           (1 << 21) /* Bit 21: Start Conversion of injected channels */
#  define ADC_CR2_SWSTART            (1 << 22) /* Bit 22: Start Conversion of regular channels */
#  define ADC_CR2_TSVREFE            (1 << 23) /* Bit 23: Temperature Sensor and VREFINT Enable */
#endif

/* ADC sample time register 1 */

#ifndef HAVE_BASIC_ADC
#  define ADC_SMPR_3                 0         /* 000: 3 cycles */
#  define ADC_SMPR_15                1         /* 001: 15 cycles */
#  define ADC_SMPR_28                2         /* 010: 28 cycles */
#  define ADC_SMPR_56                3         /* 011: 56 cycles */
#  define ADC_SMPR_84                4         /* 100: 84 cycles */
#  define ADC_SMPR_112               5         /* 101: 112 cycles */
#  define ADC_SMPR_144               6         /* 110: 144 cycles */
#  define ADC_SMPR_480               7         /* 111: 480 cycles */
#else
#  define ADC_SMPR_1p5               0         /* 000: 1.5 cycles */
#  define ADC_SMPR_7p5               1         /* 001: 7.5 cycles */
#  define ADC_SMPR_13p5              2         /* 010: 13.5 cycles */
#  define ADC_SMPR_28p5              3         /* 011: 28.5 cycles */
#  define ADC_SMPR_41p5              4         /* 100: 41.5 cycles */
#  define ADC_SMPR_55p5              5         /* 101: 55.5 cycles */
#  define ADC_SMPR_71p5              6         /* 110: 71.5 cycles */
#  define ADC_SMPR_239p5             7         /* 111: 239.5 cycles */
#endif

#define ADC_SMPR1_SMP10_SHIFT        (0)       /* Bits 0-2: Channel 10 Sample time selection */
#define ADC_SMPR1_SMP10_MASK         (7 << ADC_SMPR1_SMP10_SHIFT)
#define ADC_SMPR1_SMP11_SHIFT        (3)       /* Bits 3-5: Channel 11 Sample time selection */
#define ADC_SMPR1_SMP11_MASK         (7 << ADC_SMPR1_SMP11_SHIFT)
#define ADC_SMPR1_SMP12_SHIFT        (6)       /* Bits 6-8: Channel 12 Sample time selection */
#define ADC_SMPR1_SMP12_MASK         (7 << ADC_SMPR1_SMP12_SHIFT)
#define ADC_SMPR1_SMP13_SHIFT        (9)       /* Bits 9-11: Channel 13 Sample time selection */
#define ADC_SMPR1_SMP13_MASK         (7 << ADC_SMPR1_SMP13_SHIFT)
#define ADC_SMPR1_SMP14_SHIFT        (12)      /* Bits 12-14: Channel 14 Sample time selection */
#define ADC_SMPR1_SMP14_MASK         (7 << ADC_SMPR1_SMP14_SHIFT)
#define ADC_SMPR1_SMP15_SHIFT        (15)      /* Bits 15-17: Channel 15 Sample time selection */
#define ADC_SMPR1_SMP15_MASK         (7 << ADC_SMPR1_SMP15_SHIFT)
#define ADC_SMPR1_SMP16_SHIFT        (18)      /* Bits 18-20: Channel 16 Sample time selection */
#define ADC_SMPR1_SMP16_MASK         (7 << ADC_SMPR1_SMP16_SHIFT)
#define ADC_SMPR1_SMP17_SHIFT        (21)      /* Bits 21-23: Channel 17 Sample time selection */
#define ADC_SMPR1_SMP17_MASK         (7 << ADC_SMPR1_SMP17_SHIFT)
#ifndef HAVE_BASIC_ADC
#  define ADC_SMPR1_SMP18_SHIFT      (24)      /* Bits 24-26: Channel 18 Sample time selection */
#  define ADC_SMPR1_SMP18_MASK       (7 << ADC_SMPR1_SMP18_SHIFT)
#endif

/* ADC sample time register 2 */

