apache/nuttx/arch/arm/src/stm32/hardware/stm32_adc_v1.h
/* ADC regular data register */

#define ADC_DR_RDATA_SHIFT           (0)       /* Bits 15-0 Regular data */
#define ADC_DR_RDATA_MASK            (0xffff << ADC_DR_RDATA_SHIFT)
#ifdef HAVE_BASIC_ADC
#  define ADC_DR_ADC2DATA_SHIFT      (16)      /* Bits 31-16: ADC2 data */
#  define ADC_DR_ADC2DATA_MASK       (0xffff << ADC_DR_ADC2DATA_SHIFT)
#endif

/* Common status register */

#ifndef HAVE_BASIC_ADC
#  define ADC_CSR_AWD1               (1 << 0)  /* Bit 0:  Analog watchdog flag of ADC1 (copy of AWD in ADC1_SR) */
#  define ADC_CSR_EOC1               (1 << 1)  /* Bit 1:  End of conversion of ADC1 (copy of EOC in ADC1_SR) */
#  define ADC_CSR_JEOC1              (1 << 2)  /* Bit 2:  Injected channel end of conversion of ADC1 (copy of JEOC in ADC1_SR) */
#  define ADC_CSR_JSTRT1             (1 << 3)  /* Bit 3:  Injected channel Start flag of ADC1 (copy of JSTRT in ADC1_SR) */
#  define ADC_CSR_STRT1              (1 << 4)  /* Bit 4:  Regular channel Start flag of ADC1 (copy of STRT in ADC1_SR) */
#  define ADC_CSR_OVR1               (1 << 5)  /* Bit 5:  Overrun flag of ADC1 (copy of OVR in ADC1_SR) */
                                               /* Bits 6-7: Reserved, must be kept at reset value. */

#  define ADC_CSR_AWD2               (1 << 8)  /* Bit 8:  Analog watchdog flag of ADC2   (copy of AWD in ADC2_SR) */
#  define ADC_CSR_EOC2               (1 << 9)  /* Bit 9:  End of conversion of ADC2   (copy of EOC in ADC2_SR) */
#  define ADC_CSR_JEOC2              (1 << 10) /* Bit 10: Injected channel end of conversion of ADC2   (copy of JEOC in ADC2_SR) */
#  define ADC_CSR_JSTRT2             (1 << 11) /* Bit 11: Injected channel Start flag of ADC2   (copy of JSTRT in ADC2_SR) */
#  define ADC_CSR_STRT2              (1 << 12) /* Bit 12: Regular channel Start flag of ADC2   (copy of STRT in ADC2_SR) */
#  define ADC_CSR_OVR2               (1 << 13) /* Bit 13: Overrun flag of ADC2   (copy of OVR in ADC2_SR) */
                                               /* Bits 14-15: Reserved, must be kept at reset value. */
#  define ADC_CSR_AWD3               (1 << 16) /* Bit 16: ADC3 Analog watchdog flag   (copy of AWD in ADC3_SR) */
#  define ADC_CSR_EOC3               (1 << 17) /* Bit 17: ADC3 End of conversion   (copy of EOC in ADC3_SR) */
#  define ADC_CSR_JEOC3              (1 << 18) /* Bit 18: ADC3 Injected channel end of conversion   (copy of JEOC in ADC3_SR) */
#  define ADC_CSR_JSTRT3             (1 << 19) /* Bit 19: ADC3 Injected channel Start flag   (copy of JSTRT in ADC3_SR) */
#  define ADC_CSR_STRT3              (1 << 20) /* Bit 20: ADC3 Regular channel Start flag   (copy of STRT in ADC3_SR). */
#  define ADC_CSR_OVR3               (1 << 21) /* Bit 21: ADC3 overrun flag   (copy of OVR in ADC3_SR). */
                                               /* Bits 22-31: Reserved, must be kept at reset value. */
#endif

/* Common control register */

#ifndef HAVE_BASIC_ADC
#  define ADC_CCR_MULTI_SHIFT        (0)       /* Bits 0-4: Multi ADC mode selection */
#  define ADC_CCR_MULTI_MASK         (31 << ADC_CCR_MULTI_SHIFT)
#    define ADC_CCR_MULTI_NONE       (0 << ADC_CCR_MULTI_SHIFT)  /* 00000: Independent mode */
                                                                 /* 00001 to 01001: Dual mode (ADC1 and ADC2), ADC3 independent */
#    define ADC_CCR_MULTI_RSISM2     (1 << ADC_CCR_MULTI_SHIFT)  /* 00001: Combined regular simultaneous + injected simultaneous mode */
#    define ADC_CCR_MULTI_RSATM2     (2 << ADC_CCR_MULTI_SHIFT)  /* 00010: Combined regular simultaneous + alternate trigger mode */
#    define ADC_CCR_MULTI_ISM2       (5 << ADC_CCR_MULTI_SHIFT)  /* 00101: Injected simultaneous mode only */
#    define ADC_CCR_MULTI_RSM2       (6 << ADC_CCR_MULTI_SHIFT)  /* 00110: Regular simultaneous mode only */
#    define ADC_CCR_MULTI_IM2        (7 << ADC_CCR_MULTI_SHIFT)  /* 00111: interleaved mode only */
#    define ADC_CCR_MULTI_ATM2       (9 << ADC_CCR_MULTI_SHIFT)  /* 01001: Alternate trigger mode only */
                                                                 /* 10001 to 11001: Triple mode (ADC1, 2 and 3) */
#    define ADC_CCR_MULTI_RSISM3     (17 << ADC_CCR_MULTI_SHIFT) /* 10001: Combined regular simultaneous + injected simultaneous mode */
#    define ADC_CCR_MULTI_RSATM3     (18 << ADC_CCR_MULTI_SHIFT) /* 10010: Combined regular simultaneous + alternate trigger mode */
#    define ADC_CCR_MULTI_ISM3       (21 << ADC_CCR_MULTI_SHIFT) /* 10101: Injected simultaneous mode only */
#    define ADC_CCR_MULTI_RSM3       (22 << ADC_CCR_MULTI_SHIFT) /* 10110: Regular simultaneous mode only */
#    define ADC_CCR_MULTI_IM3        (23 << ADC_CCR_MULTI_SHIFT) /* 10111: interleaved mode only */
#    define ADC_CCR_MULTI_ATM3       (25 << ADC_CCR_MULTI_SHIFT) /* 11001: Alternate trigger mode only */

/*                                                Bits 5-7: Reserved,
 *                                               must be kept at reset value.
 */

#  define ADC_CCR_DELAY_SHIFT        (8)       /* Bits 8-11: Delay between 2 sampling phases */
#  define ADC_CCR_DELAY_MASK         (15 << ADC_CCR_DELAY_SHIFT)
#    define ADC_CCR_DELAY(n)         (((n)-5) << ADC_CCR_DELAY_SHIFT) /* n * TADCCLK, n=5-20 */

/*                                                Bit 12 Reserved,
 *                                               must be kept at reset value.
 */

#  define ADC_CCR_DDS                (1 << 13) /* Bit 13: DMA disable selection (for multi-ADC mode) */

#  define ADC_CCR_DMA_SHIFT          (14)      /* Bits 14-15: Direct memory access mode for multi ADC mode */
#  define ADC_CCR_DMA_MASK           (3 << ADC_CCR_DMA_SHIFT)
#    define ADC_CCR_DMA_DISABLED     (0 << ADC_CCR_DMA_SHIFT) /* 00: DMA mode disabled */
#    define ADC_CCR_DMA_MODE1        (1 << ADC_CCR_DMA_SHIFT) /* 01: DMA mode 1 enabled */
#    define ADC_CCR_DMA_MODE2        (2 << ADC_CCR_DMA_SHIFT) /* 10: DMA mode 2 enabled */
#    define ADC_CCR_DMA_MODE3        (3 << ADC_CCR_DMA_SHIFT) /* 11: DMA mode 3 enabled */

#  define ADC_CCR_ADCPRE_SHIFT       (16)      /* Bits 16-17: ADC prescaler */
#  define ADC_CCR_ADCPRE_MASK        (3 << ADC_CCR_ADCPRE_SHIFT)
#    define ADC_CCR_ADCPRE_DIV2      (0 << ADC_CCR_ADCPRE_SHIFT) /* 00: PCLK2 divided by 2 */
#    define ADC_CCR_ADCPRE_DIV4      (1 << ADC_CCR_ADCPRE_SHIFT) /* 01: PCLK2 divided by 4 */
#    define ADC_CCR_ADCPRE_DIV6      (2 << ADC_CCR_ADCPRE_SHIFT) /* 10: PCLK2 divided by 6 */
#    define ADC_CCR_ADCPRE_DIV8      (3 << ADC_CCR_ADCPRE_SHIFT) /* 11: PCLK2 divided by 8 */

/*                                                Bits 18-21: Reserved,
 *                                               must be kept at reset value.
 */
#  define ADC_CCR_VBATEN             (1 << 22) /* Bit 22: VBAT enable */
#  define ADC_CCR_TSVREFE            (1 << 23) /* Bit 23: Temperature sensor and VREFINT enable */
                                               /* Bits 24-31 Reserved, must be kept at reset value. */
#endif

/* Data register for dual and triple modes
 * (32-bit data with no named fields)
 */

/****************************************************************************
 * Public Types
 ****************************************************************************/

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

#endif /* __ARCH_ARM_SRC_STM32_HARDWARE_STM32_ADC_V1_H */
